sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
/**
 * Author: sascha_lammers@gmx.de
 */

/**
 * Quick and dirty library to compile ESP8266 code with MSVC++ as native Win32 Console Application
 */

#pragma once

#define forward_delete(iterator)  \
    ({                            \
        auto next = iterator + 1; \
        delete *iterator;         \
        next;                     \
    })
#define reverse_delete(iterator)  \
    ({                            \
        auto prev = iterator - 1; \
        delete *iterator;         \
        prev;                     \
    })

#if defined(ESP32)

#include <Arduino.h>
#include <SPIFFS.h>
#include <WiFi.h>

#elif defined(ESP8266)

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WiFiType.h>
#include <WiFiUdp.h>
#include <FS.h>

#include "C:/Users/sascha/Documents/PlatformIO/Projects/kfc_fw/include/debug_helper.h"
#include "C:/Users/sascha/Documents/PlatformIO/Projects/kfc_fw/include/misc.h"

#elif _WIN32 || _WIN64

#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include <winsock.h>
#include <strsafe.h>
#include <iostream>

//#define F(str) (reinterpret_cast<char *>(str))
#define PSTR(str) str
#define FPSTR(str) str
#define snprintf_P snprintf
#define sprintf_P sprintf
#define strstr_P strstr
#define strlen_P strlen
#define pgm_read_byte(a) (*a)

#ifndef WIFI_CB_EVENT_CONNECTED

#define WIFI_CB_EVENT_CONNECTED        0x01
#define WIFI_CB_EVENT_DISCONNECTED     0x02
#define WIFI_CB_EVENT_MODE_CHANGE      0x04
#define WIFI_CB_EVENT_ANY              (WIFI_CB_EVENT_CONNECTED|WIFI_CB_EVENT_DISCONNECTED|WIFI_CB_EVENT_MODE_CHANGE)

typedef void(*WiFiEventFunc)(uint8_t event, void *payload);

#endif

typedef const char *PGM_P;
class __FlashStringHelper;

#define __FPSTR(pstr_pointer) (reinterpret_cast<const __FlashStringHelper *>(pstr_pointer))
#define __PSTR(s) ((const char *)s)
#define F(string_literal) (__FPSTR(__PSTR(string_literal)))

#define strcpy_P strcpy
#define strncpy_P strncpy_s

const char *str_P(const char *str, uint8_t index = 0);  // not the same function as in misc.cpp just a dummy

#if DEBUG
#define if_debug_printf(...) printf(__VA_ARGS__);
#define if_debug_printf_P(...) printf(__VA_ARGS__);
#define debug_printf_P(...) printf(__VA_ARGS__);
#else
#define if_debug_printf(...) ;
#define if_debug_printf_P(...) ;
#define debug_printf_P(...) ;
#endif

#define strcasecmp_P _stricmp
#define strcmp_P _strcmp

#define strdup _strdup
void throwException(PGM_P message);

uint16_t _crc16_update(uint16_t crc = ~0x0, const uint8_t a = 0);
uint16_t crc16_calc(uint8_t const *data, size_t length);

unsigned long millis();

void delay(uint32_t time_ms);

class Print;

class Printable {
   public:
    virtual size_t printTo(Print &p) const = 0;
};

#define DEC 10
#define HEX 16
#define OCT 8
#define BIN 2

class String;

class Print {
   private:
    int write_error;
    size_t printNumber(unsigned long, uint8_t);
    size_t printFloat(double, uint8_t);

   protected:
    void setWriteError(int err = 1) {
        write_error = err;
    }

   public:
    Print() : write_error(0) {
    }

    int getWriteError() {
        return write_error;
    }
    void clearWriteError() {
        setWriteError(0);
    }

    virtual size_t write(uint8_t) = 0;
    size_t write(const char *str) {
        if (str == NULL) return 0;
        return write((const uint8_t *)str, strlen(str));
    }
    virtual size_t write(const uint8_t *buffer, size_t size);
    size_t write(const char *buffer, size_t size) {
        return write((const uint8_t *)buffer, size);
    }

    size_t printf(const char *format, ...);
    size_t printf_P(PGM_P format, ...);
    size_t print(const __FlashStringHelper *);
    size_t print(const String &);
    size_t print(const char[]);
    size_t print(char);
    size_t print(unsigned char, int = DEC);
    size_t print(int, int = DEC);
    size_t print(unsigned int, int = DEC);
    size_t print(long, int = DEC);
    size_t print(unsigned long, int = DEC);
    size_t print(double, int = 2);
    size_t print(const Printable &);

    size_t println(const __FlashStringHelper *);
    size_t println(const String &s);
    size_t println(const char[]);
    size_t println(char);
    size_t println(unsigned char, int = DEC);
    size_t println(int, int = DEC);
    size_t println(unsigned int, int = DEC);
    size_t println(long, int = DEC);
    size_t println(unsigned long, int = DEC);
    size_t println(double, int = 2);
    size_t println(const Printable &);
    size_t println(void);

    virtual void flush() { /* Empty implementation for backward compatibility */
    }
};

class String : public std::string {
   public:
    String() : std::string() {
    }
    String(bool value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%d", value);
        assign(buf);
    }
    String(int16_t value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%d", value);
        assign(buf);
    }
    String(uint16_t value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%d", value);
        assign(buf);
    }
    String(int32_t value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%d", value);
        assign(buf);
    }
    String(uint32_t value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%u", value);
        assign(buf);
    }
    String(int64_t value) : std::string() {
        char buf[32];
        snprintf(buf, sizeof(buf), "%lld", value);
        assign(buf);
    }
    String(uint64_t value) : std::string() {
        char buf[32];
        snprintf(buf, sizeof(buf), "%llu", value);
        assign(buf);
    }
    String(long value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%ld", value);
        assign(buf);
    }
    String(unsigned long value) : std::string() {
        char buf[16];
        snprintf(buf, sizeof(buf), "%lu", value);
        assign(buf);
    }
    String(float value) : std::string() {
        char buf[32];
        snprintf(buf, sizeof(buf), "%f", value);
        assign(buf);
    }
    String(const char ch) : String() {
        assign(1, ch);
    }
    String(const char *str) : std::string(str) {
    }
	String(const __FlashStringHelper *str) : std::string(reinterpret_cast<const char *>(str)) {

