sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
    String readString() {
        String buf;
        while (available()) {
            int ch = read();
            if (ch == -1) {
                break;
            }
            buf += (char)ch;
        }
        return buf;
    }

	virtual size_t readBytes(char *buffer, size_t length) {
		return read((uint8_t *)buffer, length);
	}
    virtual size_t readBytes(uint8_t *buffer, size_t length) {
        return readBytes((char *)buffer, length);
    }

    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    virtual size_t write(const uint8_t *data, size_t len) {
        size_t size = fwrite(data, 1, len, _fp);
        if (ferror(_fp)) {
            perror("write");
        }
        return size;
    }

    virtual void close() {
		if (_fp) {
			fclose(_fp);
		}
    }

    virtual void flush() {
        fflush(_fp);
    }

    virtual int available() {
        return feof(_fp) ? 0 : 1;
    }

   private:
    FILE *_fp;
    size_t _size;
};

class File : public Stream {
   public:
    File() : Stream() {
    }
    File(FILE *fp) : Stream(fp) {
    }
};

class Dir {
public:

	static void __test();

	Dir(const String directory) : _handle(INVALID_HANDLE_VALUE) {
		_directory = directory;
		_directory.replace('/', '\\');
		if (!_directory.endsWith("\\")) {
			_directory += '\\';
		}
	}
	~Dir() {
		if (_handle != INVALID_HANDLE_VALUE) {
			FindClose(_handle);
			_handle = INVALID_HANDLE_VALUE;
		}
	}

	bool next() {
		bool result;
		if (_handle == INVALID_HANDLE_VALUE) {
			TCHAR path[MAX_PATH];
			size_t convertedChars = 0;
			mbstowcs_s(&convertedChars, path, MAX_PATH, _directory.c_str(), _TRUNCATE);
			StringCchCat(path, MAX_PATH, TEXT("*"));
			if ((_handle = FindFirstFile(path, &_ffd)) == INVALID_HANDLE_VALUE) {
				return false;
			}
			result = true;
		} else {
			result = FindNextFile(_handle, &_ffd);
		}
		return result;
	}

	bool isDirectory() const {
		return (_handle != INVALID_HANDLE_VALUE) && (_ffd.dwFileAttributes & FILE_ATTRIBUTE_DIRECTORY);
	}

	bool isFile() const {
		return (_handle != INVALID_HANDLE_VALUE) && !(_ffd.dwFileAttributes & FILE_ATTRIBUTE_DIRECTORY);
	}

	const String fileName() const {
		String tmp;
		tmp.reserve(wcslen(_ffd.cFileName) + 1);
        size_t convertedChars;
        wcstombs_s(&convertedChars, tmp.begin(), tmp.capacity(), _ffd.cFileName, _TRUNCATE);
        tmp.replace('\\', '/');
		return tmp;
	}

	uint32_t fileSize() const {
		if (isFile()) {
            return _ffd.nFileSizeLow;
		}
		return 0;
	}

	File openFile(const char *mode);

private:
	HANDLE _handle;
	WIN32_FIND_DATA _ffd;
	String _directory;
};


class _SPIFFS {
   public:
    File open(const String filename, const char *mode) {
        FILE *fp;
        fopen_s(&fp, filename.c_str(), mode);
        return File(fp);
    }

	Dir openDir(const String dir) {
		return Dir(dir);
	}

	bool exists(const String filename) {
		File file = open(filename, "r");
		bool result = !!file;
		file.close();
		return result;
	}

	bool remove(const String filename) {
		return ::remove(filename.c_str()) == 0;
	}

	bool rename(const String fromPath, const String toPath) {
		return ::rename(fromPath.c_str(), toPath.c_str()) == 0;
	}
};

class IPAddress {
   public:
    struct _address {
        uint8_t byte[4];
    };

    IPAddress() {
        _addr = 0;
    }
    IPAddress(uint32_t addr) {
        _addr = addr;
    }
    IPAddress(const String &addr) {
        fromString(addr);
    }
    IPAddress(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
        ((_address *)&_addr)->byte[0] = a;
        ((_address *)&_addr)->byte[1] = b;
        ((_address *)&_addr)->byte[2] = c;
        ((_address *)&_addr)->byte[3] = d;
    }

    IPAddress &operator=(uint32_t addr) {
        _addr = addr;
        return *this;
    }
    bool operator==(const IPAddress &addr) {
        return _addr = addr._addr;
    }

    void fromString(const String &addr) {
        _addr = inet_addr(addr.c_str());
    }
    String toString() const {
        in_addr a;
        a.S_un.S_addr = _addr;
        return inet_ntoa(a);
    }

    uint8_t *raw_address() const {
        return (uint8_t *)&_addr;
    }

   private:
    uint32_t _addr;
};

class EEPROMFile : public Stream {
   public:
    EEPROMFile(uint16_t size = 4096) {
        _position = 0;
        _size = size;
        _eeprom = nullptr;
    }
    ~EEPROMFile() {
        close();
    }

    bool begin() {
        if (_eeprom) {
            free(_eeprom);
        }
        _eeprom = (uint8_t *)malloc(_size);
        if (!_eeprom) {
            return false;
        }
        FILE *fp;
        errno_t err = fopen_s(&fp, "eeprom.bin", "rb");
        if (err) {
            memset(_eeprom, 0, _size);
            if (commit()) {
                return true;
            }
            return false;
        }
        if (fread(_eeprom, _size, 1, fp) != 1) {
            perror("read");
            fclose(fp);
            return false;
        }
        fclose(fp);
        return true;
    }

    void end() {
        if (_eeprom) {
            commit();
            free(_eeprom);
            _eeprom = nullptr;
        }
    }

    bool commit() {
        FILE *fp;
        errno_t err = fopen_s(&fp, "eeprom.bin", "wb");
        if (err) {
            return false;
        }
        if (fwrite(_eeprom, _size, 1, fp) != 1) {
            perror("write");
            return false;
        }
        fclose(fp);
        return true;
    }

    void close() {
        end();
    }

    size_t position() {
        return _position;
    }

    bool seek(long pos, int mode) override {
        if (mode == SeekSet) {
            if (pos >= 0 && pos < _size) {
                _position = (uint16_t)pos;
                return true;
            }
        } else if (mode == SeekCur) {
            return seek(_position + pos, SeekSet);
        } else if (mode == SeekEnd) {
            return seek(_size - pos, SeekSet);
        }
        return false;
    }
    bool seek(long pos) {
        return seek(pos, SeekSet);
    }

    int read() override {
        uint8_t ch;
        if (read(&ch, sizeof(ch)) != 1) {
            return -1;
        }
        return ch;
    }
    int read(uint8_t *buffer, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(buffer, _eeprom + _position, len);
        _position += (uint16_t)len;
        return len;
    }


    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    size_t write(uint8_t *data, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(_eeprom + _position, data, len);
        _position += (uint16_t)len;
        return len;
    }

    void flush() {
    }

    size_t size() const override {
        return _size;
    }

    int available() override {
        return _size - _position;
    }

