sascha432/esp8266-kfc-fw/lib/KFCBaseLibrary/include/Arduino_compat.h
   private:
    FILE *fp;
    uint8_t *_eeprom;
    uint16_t _position;
    uint16_t _size;
};

extern _SPIFFS SPIFFS;

class Stdout : public Stream {
   public:
    Stdout() : Stream() {
        _size = 0xffff;
        _position = 0;
        _buffer = (uint8_t *)calloc(_size, 1);
    }
    ~Stdout() {
        close();
    }

    void close() {
        free(_buffer);
        _buffer = nullptr;
    }

    size_t position() const override {
        return _position;
    }

    bool seek(long pos, int mode) {
        if (mode == SeekSet) {
            if (pos >= 0 && pos < _size) {
                _position = (uint16_t)pos;
                return true;
            }
        } else if (mode == SeekCur) {
            return seek(_position + pos, SeekSet);
        } else if (mode == SeekEnd) {
            return seek(_size - pos, SeekSet);
        }
        return false;
    }
    bool seek(long pos) {
        return seek(pos, SeekSet);
    }

    int read() {
        uint8_t ch;
        if (read(&ch, sizeof(ch)) != 1) {
            return -1;
        }
        return ch;
    }
    int read(uint8_t *buffer, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        memcpy(buffer, _buffer + _position, len);
        return len;
    }


    size_t write(char data) {
        return write((uint8_t)data);
    }
    size_t write(uint8_t data) {
        return write(&data, sizeof(data));
    }
    size_t write(uint8_t *data, size_t len) {
        if (_position + len >= _size) {
            len = _size - _position;
        }
        printf("%04x-%04x: ", _position, _position + len - 1);
        for (size_t i = 0; i < len; i++) {
            printf("%02x ", data[i]);
        }
        for (size_t i = 0; i < len; i++) {
            if (isalnum(data[i])) {
                printf("%c", data[i]);
            } else {
                printf(".");
            }
        }
        printf("\n");
        memcpy(_buffer + _position, data, len);
        _position += (uint16_t)len;
        return len;
    }

    void flush() {
    }

    size_t size() const {
        return _size;
    }

    int available() override {
        return _size - _position;
    }


   private:
    uint8_t *_buffer;
    uint16_t _position;
    uint16_t _size;
};

class FakeSerial : public Stdout {
   public:
    FakeSerial() : Stdout() {
    }
    virtual int available() {
        return 0;
    }
    virtual int read() {
        return -1;
    }
    virtual int peek() {
        return -1;
    }
    void flush(void) override {
        fflush(stdout);
    }
    virtual size_t write(uint8_t c) {
        ::printf("%c", c);
        return 1;
    }
};

extern FakeSerial Serial;

#pragma comment(lib, "Ws2_32.lib")

class WiFiUDP : public Stream {
   public:
    WiFiUDP();
    ~WiFiUDP();

    int beginPacket(const char *host, uint16_t port);
    int beginPacket(IPAddress ip, uint16_t port);
    size_t write(uint8_t byte);
    size_t write(const uint8_t *buffer, size_t size);
    void flush();
    int endPacket();

   private:
    int _beginPacket(uint16_t port);
    void _clear();

    int available() override {
        return 0;
    }
    int read() override {
        return -1;
    }
    int peek() override {
        return -1;
    }


   private:
    SOCKET _socket;
    sockaddr_in _dst;
    char *_buffer;
    uint16_t _len;
};

class ESP8266WiFiClass {
   public:
    ESP8266WiFiClass() {
        _isConnected = true;
    }

    bool isConnected() {
        return _isConnected;
    }
    void setIsConnected(bool connected) {
        _isConnected = connected;
    }

   private:
    bool _isConnected;
};

class StringStream : public Stream {
public:
	StringStream(String &string);
	virtual ~StringStream();

	virtual int available() override;
	virtual int read() override;
	virtual int peek() override;
	virtual size_t write(uint8_t data);

private:
	uint16_t _position;
	String &_string;
};

class BufferStream;

class HTTPClient {
public:
	HTTPClient();
	virtual ~HTTPClient();

	void begin(String url);
	void end();

	int GET();
	size_t getSize();
	Stream &getStream();

private:
	void _close();

	SOCKET _socket;
	String _url;
	String _host;
	uint16_t _port;
	String _path;
	BufferStream *_body;
	int _httpCode;
};

extern ESP8266WiFiClass WiFi;
extern String _sharedEmptyString;

#else

#error Platform not supported

#endif
